Catalogs/ГосударственныеСтандартыИТехническиеУсловия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ГосударственныеСтандартыИТехническиеУсловия</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидСтандартаКачества</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтандартовКачества</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаСРасширением</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиКачества</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоказателиКачестваПродукции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаОт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаДо</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ГосударственныеСтандартыИТехническиеУсловия/Forms/ФормаЭлементаУпр/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ
//

&НаСервере
Процедура УправлениеФормой()
	
	Если НЕ ЗначениеЗаполнено(Объект.ИмяФайла) Тогда
		Элементы.ГруппаФайл.ТекущаяСтраница = Элементы.ГруппаФайлДобавление;
	Иначе
		Элементы.ГруппаФайл.ТекущаяСтраница = Элементы.ГруппаФайлОткрытие;
	КонецЕсли;
	
КонецПроцедуры



////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая()Тогда
		
		Если Параметры.Свойство("Номенклатура")Тогда
			
			Номенклатура = Параметры.Номенклатура;
			Если ЗначениеЗаполнено(Номенклатура)Тогда
				
				ВСоставе = Ложь;
				НоменклатураИлиРодительЕстьВСоставе(Номенклатура, ВСоставе);
				
				Если Не ВСоставе Тогда
					
					НС = Объект.Состав.Добавить();
					НС.Номенклатура = Номенклатура;
					
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ КОМАНД ФОРМЫ
//

&НаКлиенте
Процедура ВыбратьФайлГостТУ(Команда)
	
	#Если Не ВебКлиент Тогда
		
		Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогФайла.МножественныйВыбор = Ложь;
		ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
		
		Если ДиалогФайла.Выбрать() Тогда
			
			Режим = РежимДиалогаВыбораФайла.Открытие;
		ДиалогФайла = Новый ДиалогВыбораФайла(Режим);
		
		ДиалогФайла.МножественныйВыбор = Ложь;
		ДиалогФайла.ПроверятьСуществованиеФайла = Истина;
		
		Если ДиалогФайла.Выбрать() Тогда
			
			ПолноеИмяФайла   = ДиалогФайла.ПолноеИмяФайла;
			ИмяФайлаСРасширением = ПолучитьСтрокуОтделеннойСимволом(ПолноеИмяФайла, "\");
			Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(ПолноеИмяФайла);
			
			АдресВременногоХранилища = "";
			Если ПоместитьФайл(АдресВременногоХранилища, ПолноеИмяФайла,, Ложь)Тогда
				ЗаписатьФайлНаСервере(АдресВременногоХранилища, ИмяФайлаСРасширением, Расширение);
			Иначе 
				Сообщить("Не удалось добавить файл.");
			КонецЕсли;
			
		КонецЕсли;
			
		КонецЕсли;
		
	#КонецЕсли
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	
		Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Объект.ИмяФайлаСРасширением);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
		Если ПолучитьФайл(АдресФайла, ИмяВременногоФайла, Ложь) Тогда
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
		
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьФайл(Команда)
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	Ответ = Вопрос("Вы действительно хотите удалить файл ГОСТ/ТУ?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	
	// Т.к. файлы хранятся на сервере
	УдалитьФайлНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ
//

&НаКлиенте
Процедура ВидСтандартаКачестваПриИзменении(Элемент)
	
	УправлениеФормой();
	
КонецПроцедуры

&НаСервере
// функция возвращает часть строки после последнего встреченного символа в строке
Функция ПолучитьСтрокуОтделеннойСимволом(Знач ИсходнаяСтрока, Знач СимволПоиска)
	
	ПозицияСимвола = СтрДлина(ИсходнаяСтрока);
	Пока ПозицияСимвола >= 1 Цикл
		
		Если Сред(ИсходнаяСтрока, ПозицияСимвола, 1) = СимволПоиска Тогда
						
			Возврат Сред(ИсходнаяСтрока, ПозицияСимвола + 1); 
			
		КонецЕсли;
		
		ПозицияСимвола = ПозицияСимвола - 1;	
	КонецЦикла;

	Возврат "";
  	
КонецФункции

&НаСервере
Функция ПолучитьКаталогХраненияФайлов()

	Возврат Константы.КаталогХраненияФайлов.Получить();	

КонецФункции // ()

&НаСервере
Процедура УдалитьФайлНаСервере()
	
	Попытка
	
		УдалитьФайлы(Объект.ИмяФайла);
		
		Объект.ИмяФайла = "";
		Объект.ИмяФайлаСРасширением = "";
		
		Модифицированность = Истина;
	
	Исключение
		
	КонецПопытки;	
	
	УправлениеФормой();
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаСРасширениемНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если ПустаяСтрока(Объект.ИмяФайла)Тогда
		Возврат;
	КонецЕсли;
	
	#Если Не ВебКлиент Тогда
	
		Расширение = ПроцедурыОбменаДанными.ПолучитьРасширениеИмениФайла(Объект.ИмяФайлаСРасширением);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		АдресФайла = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(Объект.ИмяФайла), Новый УникальныйИдентификатор());
		Если ПолучитьФайл(АдресФайла, ИмяВременногоФайла, Ложь) Тогда
			ЗапуститьПриложение(ИмяВременногоФайла);
		КонецЕсли;
		
	#КонецЕсли	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии()
	
	Оповестить("ОкончаниеВводаГостаТу");
	
КонецПроцедуры

&НаСервере
Процедура НоменклатураИлиРодительЕстьВСоставе(Номенклатура, ВСоставе)
	
	НайденныеСтроки = Объект.Состав.НайтиСтроки(Новый Структура("Номенклатура", Номенклатура));
	Если НайденныеСтроки.Количество()=0 Тогда
		Если ЗначениеЗаполнено(Номенклатура.Родитель)Тогда
			НоменклатураИлиРодительЕстьВСоставе(Номенклатура.Родитель, ВСоставе);	
		КонецЕсли;
	Иначе
		ВСоставе = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьФайлНаСервере(АдресВременногоХранилища, ИмяФайлаСРасширением, Расширение)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВременногоХранилища);
	
	Попытка
		КаталогХраненияФайлов = ПолучитьКаталогХраненияФайлов();
		
		Если Прав(КаталогХраненияФайлов, 1) <> "\" Тогда
			КаталогХраненияФайлов = КаталогХраненияФайлов + "\";
		КонецЕсли;
		
	Исключение
		Сообщить("Не удалось получить каталог хранения файлов.");
		Возврат;
		
	КонецПопытки;
	
	УникальноеИмяФайла = Новый УникальныйИдентификатор;
	ИмяФайлаНаСервере = КаталогХраненияФайлов + УникальноеИмяФайла + "." + Расширение;
	
	Попытка
		
		ДвоичныеДанные.Записать(ИмяФайлаНаСервере);
		
		Объект.ИмяФайла = ИмяФайлаНаСервере;
		Объект.ИмяФайлаСРасширением = ИмяФайлаСРасширением;
		
		Модифицированность = Истина;
		
	Исключение
		Сообщить("Не удалось добавить файл.");
	КонецПопытки;
	
КонецПроцедуры
